In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\Joymode\\desktop\\pandas-challenge\\HeroesOfPymoli'

In [3]:
game_df = pd.read_csv("purchase_data.csv")
drop_dup_df = game_df.drop_duplicates(["SN"])

In [4]:
drop_dup_df.count()

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [5]:
game_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
game_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [7]:
game_df["SN"].value_counts()

Lisosia93          5
Iral74             4
Idastidru52        4
Idai61             3
Iskadarya95        3
                  ..
Farrian71          1
Aerithriaphos45    1
Tyeurith29         1
Jeyciman68         1
Haeladil46         1
Name: SN, Length: 576, dtype: int64

In [8]:
total_players = game_df["SN"].nunique()

In [9]:
total_players

576

In [10]:
game_df.describe(include='all')

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
count,780.000000,780,780.000000,780,780.000000,780,780.000000
unique,NaN,576,NaN,3,NaN,179,NaN
top,NaN,Lisosia93,NaN,Male,NaN,Final Critic,NaN
freq,NaN,5,NaN,652,NaN,13,NaN
mean,389.500000,NaN,22.714103,NaN,92.114103,NaN,3.050987
std,225.310896,NaN,6.659444,NaN,52.775943,NaN,1.169549
min,0.000000,NaN,7.000000,NaN,0.000000,NaN,1.000000
25%,194.750000,NaN,20.000000,NaN,48.000000,NaN,1.980000
50%,389.500000,NaN,22.000000,NaN,93.000000,NaN,3.150000
75%,584.250000,NaN,25.000000,NaN,139.000000,NaN,4.080000
max,779.000000,NaN,45.000000,NaN,183.000000,NaN,4.990000

In [11]:
number_of_items = game_df["Item ID"].nunique()

In [12]:
number_of_items

183

In [13]:
average_price = game_df["Price"].mean(axis = 0)

In [14]:
average_price

3.050987179487176

In [15]:
number_of_purchases = game_df["Purchase ID"].nunique()

In [16]:
number_of_purchases

780

In [17]:
total_revenue = game_df["Price"].sum()

In [18]:
total_revenue

2379.77

In [37]:
gender_of_player = drop_dup_df["Gender"].value_counts()
gender_of_player_df = pd.DataFrame(gender_of_player)
gender_of_player_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [20]:
gender_df = game_df["Gender"]

In [21]:
gender_players_purchases = game_df.groupby('Gender').count()
gender_players_purchase_id = gender_players_purchases[['Purchase ID']]

In [22]:
gender_players_purchase_id

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [23]:
gender_players_purchase_id.columns = ['Purchase Count']
gender_players_purchase_id

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [24]:
price_by_gender = game_df.groupby('Gender', as_index=False).Price.mean()
price_by_gender

                  Gender     Price
0                 Female  3.203009
1                   Male  3.017853
2  Other / Non-Disclosed  3.346000

In [45]:
total_purchase_gender = game_df.groupby('Gender')
total_purchase_gender_value = total_purchase_gender['Price'].sum()
total_purchase_gender_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [46]:
merge1_df = pd.merge(gender_players_purchase_id, price_by_gender, on="Gender")
merge1_df

                  Gender  Purchase Count     Price
0                 Female             113  3.203009
1                   Male             652  3.017853
2  Other / Non-Disclosed              15  3.346000

In [47]:
merge2_df = pd.merge(merge1_df, total_purchase_gender_value, on="Gender")
merge2_df

                  Gender  Purchase Count   Price_x  Price_y
0                 Female             113  3.203009   361.94
1                   Male             652  3.017853  1967.64
2  Other / Non-Disclosed              15  3.346000    50.19

In [53]:
average_price_gender = total_purchase_gender_value / gender_of_player_df['Gender']
average_price_gender

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [61]:
average_price_gender_df = pd.DataFrame(average_price_gender)
average_price_gender_df = average_price_gender_df.rename(columns={0: "Gender"})
average_price_gender_df

                         Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [66]:
merge3_df = pd.merge(merge2_df, average_price_gender_df, on="Gender")
merge3_df

ValueError: You are trying to merge on object and float64 columns. If you wish to proceed you should use pd.concat

In [55]:
summary_df = pd.DataFrame({"Number of Items": [number_of_items],
                     "Average Price": [average_price],
                      "Number of Purchases": [number_of_purchases],
                       "Total Revenue": [total_revenue]})

In [56]:
summary_df

   Number of Items  Average Price  Number of Purchases  Total Revenue
0              183       3.050987                  780        2379.77

In [31]:





pd.DataFrame(drop_dup_df)

bins = [0, 10, 15, 20, 25, 30, 35, 40, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [32]:
drop_dup_df["Player Age"] = pd.cut(drop_dup_df["Age"], bins, labels=group_names,  include_lowest=True)

C:\Users\Joymode\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.